# Document Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..Document Property
Subelement Class See Also
---
The document in which the subelement resides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
Subelement Class
Autodesk.Revit.DB Namespace